Revit 2026 API

# SpaceLimitOffset Property

---

Get or set the Limit Offset of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double LimitOffset { get; set; }
```
```vb
Public Property LimitOffset As Double
	Get
	Set
```
```cpp
public:
property double LimitOffset {
	double get ();
	void set (double value);
}
```
```fsharp
member LimitOffset : float with get, set
```

#### Property Value

Double

This property is used to get or set the Limit Offset of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace